load-testing/jmeter-tests/redis-tests/redis-queue-test.jmx
<?xml version="1.0" encoding="UTF-8"?>
<jmeterTestPlan version="1.2" properties="5.0" jmeter="5.6.2">
  <hashTree>
    <TestPlan guiclass="TestPlanGui" testclass="TestPlan" testname="Redis Queue Performance Test Plan" enabled="true">
      <stringProp name="TestPlan.comments">Load testing for Redis queue operations and concurrency management</stringProp>
      <boolProp name="TestPlan.functional_mode">false</boolProp>
      <boolProp name="TestPlan.tearDown_on_shutdown">true</boolProp>
      <boolProp name="TestPlan.serialize_threadgroups">false</boolProp>
      <elementProp name="TestPlan.arguments" elementType="Arguments" guiclass="ArgumentsPanel" testclass="Arguments" testname="User Defined Variables" enabled="true">
        <collectionProp name="Arguments.arguments">
          <elementProp name="REDIS_HOST" elementType="Argument">
            <stringProp name="Argument.name">REDIS_HOST</stringProp>
            <stringProp name="Argument.value">localhost</stringProp>
          </elementProp>
          <elementProp name="REDIS_PORT" elementType="Argument">
            <stringProp name="Argument.name">REDIS_PORT</stringProp>
            <stringProp name="Argument.value">6379</stringProp>
          </elementProp>
          <elementProp name="QUEUE_KEY" elementType="Argument">
            <stringProp name="Argument.name">QUEUE_KEY</stringProp>
            <stringProp name="Argument.value">report_queue</stringProp>
          </elementProp>
        </collectionProp>
      </elementProp>
    </TestPlan>
    <hashTree>
      <!-- Queue Operations Test Group -->
      <ThreadGroup guiclass="ThreadGroupGui" testclass="ThreadGroup" testname="Redis Queue Operations Test" enabled="true">
        <stringProp name="ThreadGroup.on_sample_error">continue</stringProp>
        <elementProp name="ThreadGroup.main_controller" elementType="LoopController" guiclass="LoopControllerGui" testclass="LoopController" testname="Loop Controller" enabled="true">
          <boolProp name="LoopController.continue_forever">false</boolProp>
          <stringProp name="LoopController.loops">20</stringProp>
        </elementProp>
        <stringProp name="ThreadGroup.num_threads">10</stringProp>
        <stringProp name="ThreadGroup.ramp_time">30</stringProp>
        <boolProp name="ThreadGroup.scheduler">false</boolProp>
        <boolProp name="ThreadGroup.same_user_on_next_iteration">true</boolProp>
      </ThreadGroup>
      <hashTree>
        <!-- Redis Connection Setup -->
        <BeanShellSampler guiclass="BeanShellSamplerGui" testclass="BeanShellSampler" testname="Redis Queue Add Operation" enabled="true">
          <stringProp name="BeanShellSampler.query">
import redis.clients.jedis.Jedis;
import java.util.UUID;

try {
    Jedis jedis = new Jedis("${REDIS_HOST}", Integer.parseInt("${REDIS_PORT}"));
    
    // Test Redis connection
    String pong = jedis.ping();
    if (!"PONG".equals(pong)) {
        throw new Exception("Redis connection failed");
    }
    
    // Generate unique report request
    String reportId = "report_" + UUID.randomUUID().toString();
    String userId = "user_" + (int)(Math.random() * 100);
    long timestamp = System.currentTimeMillis();
    
    // Add to sorted set (priority queue)
    String queueKey = "${QUEUE_KEY}";
    jedis.zadd(queueKey, timestamp, reportId + ":" + userId);
    
    // Set report status
    jedis.hset("report_status:" + reportId, "status", "PENDING");
    jedis.hset("report_status:" + reportId, "user_id", userId);
    jedis.hset("report_status:" + reportId, "created_at", String.valueOf(timestamp));
    
    // Get queue size
    long queueSize = jedis.zcard(queueKey);
    
    jedis.close();
    
    SampleResult.setResponseData("Queue operation successful. Queue size: " + queueSize + ", Report ID: " + reportId);
    SampleResult.setSuccessful(true);
    
} catch (Exception e) {
    SampleResult.setResponseData("Error: " + e.getMessage());
    SampleResult.setSuccessful(false);
}
          </stringProp>
          <boolProp name="BeanShellSampler.resetInterpreter">false</boolProp>
        </BeanShellSampler>
        <hashTree/>
        
        <!-- Queue Processing Simulation -->
        <BeanShellSampler guiclass="BeanShellSamplerGui" testclass="BeanShellSampler" testname="Redis Queue Process Operation" enabled="true">
          <stringProp name="BeanShellSampler.query">
import redis.clients.jedis.Jedis;
import java.util.Set;

try {
    Jedis jedis = new Jedis("${REDIS_HOST}", Integer.parseInt("${REDIS_PORT}"));
    
    String queueKey = "${QUEUE_KEY}";
    
    // Get next item from queue (FIFO)
    Set nextItems = jedis.zrange(queueKey, 0, 0);
    
    if (!nextItems.isEmpty()) {
        String nextItem = nextItems.iterator().next();
        String[] parts = nextItem.split(":");
        String reportId = parts[0];
        String userId = parts.length > 1 ? parts[1] : "unknown";
        
        // Remove from queue
        jedis.zrem(queueKey, nextItem);
        
        // Update status to EXECUTING
        jedis.hset("report_status:" + reportId, "status", "EXECUTING");
        jedis.hset("report_status:" + reportId, "started_at", String.valueOf(System.currentTimeMillis()));
        
        // Simulate processing time
        Thread.sleep(100);
        
        // Update status to COMPLETED
        jedis.hset("report_status:" + reportId, "status", "COMPLETED");
        jedis.hset("report_status:" + reportId, "completed_at", String.valueOf(System.currentTimeMillis()));
        
        long remainingQueueSize = jedis.zcard(queueKey);
        
        SampleResult.setResponseData("Processed report: " + reportId + " for user: " + userId + ". Remaining queue size: " + remainingQueueSize);
        SampleResult.setSuccessful(true);
    } else {
        SampleResult.setResponseData("Queue is empty");
        SampleResult.setSuccessful(true);
    }
    
    jedis.close();
    
} catch (Exception e) {
    SampleResult.setResponseData("Error: " + e.getMessage());
    SampleResult.setSuccessful(false);
}
          </stringProp>
          <boolProp name="BeanShellSampler.resetInterpreter">false</boolProp>
        </BeanShellSampler>
        <hashTree/>
      </hashTree>
      
      <!-- High Concurrency Queue Test -->
      <ThreadGroup guiclass="ThreadGroupGui" testclass="ThreadGroup" testname="High Concurrency Queue Test" enabled="true">
        <stringProp name="ThreadGroup.on_sample_error">continue</stringProp>
        <elementProp name="ThreadGroup.main_controller" elementType="LoopController" guiclass="LoopControllerGui" testclass="LoopController" testname="Loop Controller" enabled="true">
          <boolProp name="LoopController.continue_forever">false</boolProp>
          <stringProp name="LoopController.loops">10</stringProp>
        </elementProp>
        <stringProp name="ThreadGroup.num_threads">25</stringProp>
        <stringProp name="ThreadGroup.ramp_time">60</stringProp>
        <boolProp name="ThreadGroup.scheduler">false</boolProp>
        <boolProp name="ThreadGroup.same_user_on_next_iteration">true</boolProp>
      </ThreadGroup>
      <hashTree>
        <!-- Concurrent Queue Operations -->
        <BeanShellSampler guiclass="BeanShellSamplerGui" testclass="BeanShellSampler" testname="Concurrent Queue Stress Test" enabled="true">
          <stringProp name="BeanShellSampler.query">
import redis.clients.jedis.Jedis;
import java.util.UUID;

try {
    Jedis jedis = new Jedis("${REDIS_HOST}", Integer.parseInt("${REDIS_PORT}"));
    
    String queueKey = "${QUEUE_KEY}_stress";
    long startTime = System.currentTimeMillis();
    
    // Rapid queue operations
    for (int i = 0; i &lt; 5; i++) {
        String reportId = "stress_report_" + UUID.randomUUID().toString();
        String userId = "stress_user_" + (int)(Math.random() * 50);
        long timestamp = System.currentTimeMillis() + i;
        
        // Add to queue
        jedis.zadd(queueKey, timestamp, reportId + ":" + userId);
        
        // Immediately try to process
        if (Math.random() > 0.5) {
            jedis.zrem(queueKey, reportId + ":" + userId);
        }
    }
    
    // Check queue metrics
    long queueSize = jedis.zcard(queueKey);
    long memoryUsage = jedis.memoryUsage(queueKey);
    
    long endTime = System.currentTimeMillis();
    long duration = endTime - startTime;
    
    jedis.close();
    
    SampleResult.setResponseData("Stress test completed in " + duration + "ms. Final queue size: " + queueSize + ". Memory usage: " + memoryUsage + " bytes");
    SampleResult.setSuccessful(true);
    
} catch (Exception e) {
    SampleResult.setResponseData("Error: " + e.getMessage());
    SampleResult.setSuccessful(false);
}
          </stringProp>
          <boolProp name="BeanShellSampler.resetInterpreter">false</boolProp>
        </BeanShellSampler>
        <hashTree/>
      </hashTree>
      
      <!-- Results Collection -->
      <ResultCollector guiclass="ViewResultsFullVisualizer" testclass="ResultCollector" testname="View Results Tree" enabled="true">
        <boolProp name="ResultCollector.error_logging">false</boolProp>
        <stringProp name="filename">results/redis-queue-results.jtl</stringProp>
      </ResultCollector>
      <hashTree/>
      
      <ResultCollector guiclass="SummaryReport" testclass="ResultCollector" testname="Summary Report" enabled="true">
        <boolProp name="ResultCollector.error_logging">false</boolProp>
        <stringProp name="filename">results/redis-queue-summary.jtl</stringProp>
      </ResultCollector>
      <hashTree/>
    </hashTree>
  </hashTree>
</jmeterTestPlan>